sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/searchByModule.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.searchByModule">
   <soapenv:Header/>
   <soapenv:Body>
     <sug:sugarcrmUrl>https://gogqcl5763.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
     <sug:username>admin</sug:username>
     <sug:password>7F1208BBF48BCB9D8157969799F89D16</sug:password>
     <sug:searchstring>a</sug:searchstring>
     <sug:modules>
     	<item>Accounts</item>
     	<item>Leads</item>
     </sug:modules>
     <sug:offset></sug:offset>
     <sug:maxresults>10</sug:maxresults>
   </soapenv:Body>
</soapenv:Envelope>